In [1]:
import pandas as pd

In [2]:
books = [
    {
        "title": "Genetic Algorithms and Machine Learning for Programmers",
        "price": 36.99,
        "author": "Frances Buontempo"
    },
    {
        "title": "The Visual Display of Quantitative Information",
        "price": 38.00,
        "author": "Edward Tufte"
    },
    {
        "title": "Practical Object-Oriented Design",
        "author": "Sandi Metz",
        "price": 30.47
    },
    {
        "title": "Weapons of Math Destruction",
        "author": "Cathy O'Neil",
        "price": 17.44
    }
]

In [3]:
books

[{'title': 'Genetic Algorithms and Machine Learning for Programmers',
  'price': 36.99,
  'author': 'Frances Buontempo'},
 {'title': 'The Visual Display of Quantitative Information',
  'price': 38.0,
  'author': 'Edward Tufte'},
 {'title': 'Practical Object-Oriented Design',
  'author': 'Sandi Metz',
  'price': 30.47},
 {'title': 'Weapons of Math Destruction',
  'author': "Cathy O'Neil",
  'price': 17.44}]

In [4]:
books = pd.DataFrame(books)

In [5]:
books

                                               title  price             author
0  Genetic Algorithms and Machine Learning for Pr...  36.99  Frances Buontempo
1     The Visual Display of Quantitative Information  38.00       Edward Tufte
2                   Practical Object-Oriented Design  30.47         Sandi Metz
3                        Weapons of Math Destruction  17.44       Cathy O'Neil

In [6]:
len(books) 
#this is a function

4

In [7]:
books.shape 
#this is a method.  vs a function (where you put the object in the parentheses)

(4, 3)

In [8]:
books.size

12

In [9]:
books.price.sum()
#dot notation

122.9

In [10]:
print(books.price)
type(books.price)

0    36.99
1    38.00
2    30.47
3    17.44
Name: price, dtype: float64

pandas.core.series.Series

In [11]:
books['price'].sum()
#bracket notation
#df["column_name"]
#handy if the column_name has a space in it--gives an error

122.9

In [12]:
books.price.mean #etc etc methods

<bound method NDFrame._add_numeric_operations.<locals>.mean of 0    36.99
1    38.00
2    30.47
3    17.44
Name: price, dtype: float64>

In [13]:
books.index

RangeIndex(start=0, stop=4, step=1)

In [14]:
books.index == 0

array([ True, False, False, False])

In [15]:
books[books.index == 0]

                                               title  price             author
0  Genetic Algorithms and Machine Learning for Pr...  36.99  Frances Buontempo

In [16]:
books['price'][books.index == 0] #great example, think the pets ex on 20 python data manip exs

0    36.99
Name: price, dtype: float64

In [17]:
books.iloc[0]

title     Genetic Algorithms and Machine Learning for Pr...
price                                                 36.99
author                                    Frances Buontempo
Name: 0, dtype: object

In [18]:
books.price.idxmax()

1

In [19]:
books[books.index == books.price.idxmax()]

                                            title  price        author
1  The Visual Display of Quantitative Information   38.0  Edward Tufte

In [20]:
books[books.price.idxmax()] #doesn't work b/c it is looking for a column named '1'

KeyError: 1

In [ ]:
books.iloc[books.price.idxmax()]#this works instead

In [ ]:
#or creat a variable:
lowest_price_mask = books.index == books.price.idxmin()
books[lowest_price_mask]

#REMEMBER THIS ONE

In [ ]:
books[books.index >= 2] #one of the best pandas tools

In [ ]:
sandi_metz_dataframe = books[books.author == 'Sandi Metz']

In [ ]:
sandi_metz_dataframe

In [ ]:
books[books.author.str.contains('ndi Metz')]

In [ ]:
x = pd.Series(range(1,11))
x >= 5

In [ ]:
x[x>=5]

##  An Example Dataframe

The code below will create a data frame that represents grades for multiple students. We pass a dictionary where the keys will correspond to the names of the columns, and the values associated with those keys will make up the data. We will talk in more detail about different ways to create a dataframe in a coming lesson.

In [23]:
import numpy as np

np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# randomly generate scores for each student for each subject
# note that all the values need to have the same length here
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades})

type(df)

pandas.core.frame.DataFrame

In [24]:
print(df)

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

In [25]:
df

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

In [26]:
df[df['name'] == 'Jane']
#specific row by name

   name  math  english  reading
1  Jane    88       79       67

In [27]:
#albert's math score??
df[df.name == "Albert"].math

8    92
Name: math, dtype: int64

In [28]:
df.name == "Albert"

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8      True
9     False
10    False
11    False
Name: name, dtype: bool

In [29]:
albert_mask = df.name == "Albert"

In [30]:
df[albert_mask]

     name  math  english  reading
8  Albert    92       62       87

In [31]:
albert_records = df[albert_mask]

In [32]:
albert_records.math

8    92
Name: math, dtype: int64

# Summarizing Dataframes

In [33]:
df

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     12 non-null     object
 1   math     12 non-null     int64
 2   english  12 non-null     int64
 3   reading  12 non-null     int64
dtypes: int64(3), object(1)
memory usage: 512.0+ bytes

In [35]:
df.describe()

            math    english    reading
count  12.000000  12.000000  12.000000
mean   84.833333  77.666667  86.500000
std    11.134168  13.371158   9.643651
min    62.000000  62.000000  67.000000
25%    78.500000  63.750000  80.750000
50%    90.000000  77.500000  89.000000
75%    92.250000  86.750000  93.250000
max    98.000000  99.000000  98.000000

In [36]:
df.describe().index

Index(['count', 'mean', 'std', 'min', '25%', '50%', '75%', 'max'], dtype='object')

In [37]:
df.dtypes #super helpful

name       object
math        int64
english     int64
reading     int64
dtype: object

In [38]:
df.shape

(12, 4)

In [39]:
type(df.shape)
#you can call on a tuple

tuple

In [40]:
#number of rows?
df.shape[0]

12

In [41]:
#number columns?
df.shape[1]

4

In [42]:
df.columns

Index(['name', 'math', 'english', 'reading'], dtype='object')

In [43]:
df.index

RangeIndex(start=0, stop=12, step=1)

In [44]:
[col.upper() for col in df.columns] #not the alias in the list comprehension

['NAME', 'MATH', 'ENGLISH', 'READING']

In [45]:
df.columns = [col.upper() for col in df.columns] 
#capitalizes yourj column names

In [46]:
df

       NAME  MATH  ENGLISH  READING
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

## Subsetting Dataframes
We can see multiple columns in the df by subsetting the df with a list of strings. Next 2 examples are functionally equivalent

In [47]:
df[['NAME','MATH']]
#DOUBLE brackets; otherwise it would be like searching for a tuple with those names

       NAME  MATH
0     Sally    62
1      Jane    88
2     Suzie    94
3     Billy    98
4       Ada    77
5      John    79
6    Thomas    82
7     Marie    93
8    Albert    92
9   Richard    69
10    Isaac    92
11     Alan    92

In [48]:
df.head()

    NAME  MATH  ENGLISH  READING
0  Sally    62       85       80
1   Jane    88       79       67
2  Suzie    94       74       95
3  Billy    98       96       88
4    Ada    77       92       98

In [49]:
math_df = df[name_math_columns]

NameError: name 'name_math_columns' is not defined

In [50]:
df['MATH']

0     62
1     88
2     94
3     98
4     77
5     79
6     82
7     93
8     92
9     69
10    92
11    92
Name: MATH, dtype: int64

In [51]:
#.head, .tail, .sample

Like numpy arrays and pandas Series, pandas dataframes can also be indexed into with a boolean series.

For example, suppose we wanted to find the observations in our dataframe where the math grade is below an 80. We know that we can produce a boolean series of values using a vectorized comparison operation:

In [52]:
df.MATH < 80 
#the boolean mask that meets the condition
#indexing syntax
#df[df.column operator operand]

0      True
1     False
2     False
3     False
4      True
5      True
6     False
7     False
8     False
9      True
10    False
11    False
Name: MATH, dtype: bool

In [53]:
#Using multiple operators
#df[(mask1)|(mask2)]
df[(df.MATH < 80) | (df.READING >90)]

       NAME  MATH  ENGLISH  READING
0     Sally    62       85       80
2     Suzie    94       74       95
4       Ada    77       92       98
5      John    79       76       93
9   Richard    69       80       94
10    Isaac    92       99       93

In [54]:
#or make variables 
#df[math_less_than_80 & reading_greater_than_90]
#for instance

## Dropping and Renaming Columns
`.drop` method; `.rename` methos

They don't change the original df.  There is an argument that can be passed that will change it (inside the parentheses).

`.drop(['column'], inplace=True`)

In [55]:
df

       NAME  MATH  ENGLISH  READING
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

In [56]:
df.drop(columns = ['NAME'])

    MATH  ENGLISH  READING
0     62       85       80
1     88       79       67
2     94       74       95
3     98       96       88
4     77       92       98
5     79       76       93
6     82       64       81
7     93       63       90
8     92       62       87
9     69       80       94
10    92       99       93
11    92       62       72

In [57]:
df

       NAME  MATH  ENGLISH  READING
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

In [58]:
copy = df.copy()
#create a copy of the og df
#otherwise, any change to one will also change the other

In [59]:
#.drop returns a copy, so reassigning is the 1st way to hold the new copy
copy = copy.drop(columns=['ENGLISH','READING'])

copy
#then i can go back to the previous cell to get back everything

       NAME  MATH
0     Sally    62
1      Jane    88
2     Suzie    94
3     Billy    98
4       Ada    77
5      John    79
6    Thomas    82
7     Marie    93
8    Albert    92
9   Richard    69
10    Isaac    92
11     Alan    92

In [60]:
copy.drop(columns=['MATH'], inplace = True)

In [61]:
copy

       NAME
0     Sally
1      Jane
2     Suzie
3     Billy
4       Ada
5      John
6    Thomas
7     Marie
8    Albert
9   Richard
10    Isaac
11     Alan

In [62]:
df

       NAME  MATH  ENGLISH  READING
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

In [63]:
#.rename to reassign specific columns.  pass in a dictionary with same # of values
df.rename(columns={'NAME':'name', 'MATH': 'math'})

       name  math  ENGLISH  READING
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

In [64]:
df.drop(columns=['ENGLISH', 'READING']).rename(columns={'NAME':'student'})
#NOTE HOW .DROP TAKES A LIST AND RENAME TAKES A DICTIONARY!!!!WOW

    student  MATH
0     Sally    62
1      Jane    88
2     Suzie    94
3     Billy    98
4       Ada    77
5      John    79
6    Thomas    82
7     Marie    93
8    Albert    92
9   Richard    69
10    Isaac    92
11     Alan    92

## Creating New Columns

Usually a new column is based on existing ones

EG, new boolean col that indicates whether each student is passing math

In [65]:
df.MATH > 70

0     False
1      True
2      True
3      True
4      True
5      True
6      True
7      True
8      True
9     False
10     True
11     True
Name: MATH, dtype: bool

In [66]:
df['passing_math']  = df.MATH > 70

In [67]:
df

       NAME  MATH  ENGLISH  READING  passing_math
0     Sally    62       85       80         False
1      Jane    88       79       67          True
2     Suzie    94       74       95          True
3     Billy    98       96       88          True
4       Ada    77       92       98          True
5      John    79       76       93          True
6    Thomas    82       64       81          True
7     Marie    93       63       90          True
8    Albert    92       62       87          True
9   Richard    69       80       94         False
10    Isaac    92       99       93          True
11     Alan    92       62       72          True

In [68]:
df.passing_math.sum()

10

In [69]:
df.passing_math.mean()

0.8333333333333334

Assign also works by returning a new df w/o altering the original

In [70]:
df.assign(passing_english=df.ENGLISH >= 70)

       NAME  MATH  ENGLISH  READING  passing_math  passing_english
0     Sally    62       85       80         False             True
1      Jane    88       79       67          True             True
2     Suzie    94       74       95          True             True
3     Billy    98       96       88          True             True
4       Ada    77       92       98          True             True
5      John    79       76       93          True             True
6    Thomas    82       64       81          True            False
7     Marie    93       63       90          True            False
8    Albert    92       62       87          True            False
9   Richard    69       80       94         False             True
10    Isaac    92       99       93          True             True
11     Alan    92       62       72          True            False

In [71]:
df['school'] = 'S.A. HS'
df

       NAME  MATH  ENGLISH  READING  passing_math   school
0     Sally    62       85       80         False  S.A. HS
1      Jane    88       79       67          True  S.A. HS
2     Suzie    94       74       95          True  S.A. HS
3     Billy    98       96       88          True  S.A. HS
4       Ada    77       92       98          True  S.A. HS
5      John    79       76       93          True  S.A. HS
6    Thomas    82       64       81          True  S.A. HS
7     Marie    93       63       90          True  S.A. HS
8    Albert    92       62       87          True  S.A. HS
9   Richard    69       80       94         False  S.A. HS
10    Isaac    92       99       93          True  S.A. HS
11     Alan    92       62       72          True  S.A. HS

In [72]:
df['school'] = 'Codeup'
df

       NAME  MATH  ENGLISH  READING  passing_math  school
0     Sally    62       85       80         False  Codeup
1      Jane    88       79       67          True  Codeup
2     Suzie    94       74       95          True  Codeup
3     Billy    98       96       88          True  Codeup
4       Ada    77       92       98          True  Codeup
5      John    79       76       93          True  Codeup
6    Thomas    82       64       81          True  Codeup
7     Marie    93       63       90          True  Codeup
8    Albert    92       62       87          True  Codeup
9   Richard    69       80       94         False  Codeup
10    Isaac    92       99       93          True  Codeup
11     Alan    92       62       72          True  Codeup

## Sorting DFs

`.sort_values()`

In [73]:
df.sort_values(by="ENGLISH", ascending = False)

       NAME  MATH  ENGLISH  READING  passing_math  school
10    Isaac    92       99       93          True  Codeup
3     Billy    98       96       88          True  Codeup
4       Ada    77       92       98          True  Codeup
0     Sally    62       85       80         False  Codeup
9   Richard    69       80       94         False  Codeup
1      Jane    88       79       67          True  Codeup
5      John    79       76       93          True  Codeup
2     Suzie    94       74       95          True  Codeup
6    Thomas    82       64       81          True  Codeup
7     Marie    93       63       90          True  Codeup
8    Albert    92       62       87          True  Codeup
11     Alan    92       62       72          True  Codeup

## Chaining DF Methods

Bc most methods return a DF, it's common to chain them

In [74]:
#simple ex
"hello".capitalize().swapcase()

'hELLO'

In [75]:
df[df.ENGLISH > 90].sort_values(by='ENGLISH').head(1).NAME

4    Ada
Name: NAME, dtype: object

In [76]:
df[df.ENGLISH  > 90]

     NAME  MATH  ENGLISH  READING  passing_math  school
3   Billy    98       96       88          True  Codeup
4     Ada    77       92       98          True  Codeup
10  Isaac    92       99       93          True  Codeup

In [77]:
df[df.ENGLISH >90].sort_values(by='ENGLISH').head(1).NAME

4    Ada
Name: NAME, dtype: object

### SELF CHECK: WHERE'S YOUR BOOLEAN MASK ABOVE??

Let's break down the above expression piece by piece:

1. df: our initial variable that holds our dataframe
2. [df.ENGLISH > 90]: here we subset the datframe to find just the rows where the english grade is greater than 90
3. .sort_values(by='ENGLISH'): now we take the remaining rows and sort them by the english grade
4. .head(1): take just the first record. Because we sorted previously, this will give us the student with lowest english grade
5. .NAME: extract just the name part of the record